{
  "backend/main.mo": "Motoko backend actor providing user profiles, product CRUD, and order request handling with access‑controlled admin and user permissions.",
  "feature_evidence.json": "Feature evidence report linking the footer contact‑links change to its source file and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind base styles defining light/dark OKLCH color variables and applying background/foreground defaults.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps the app in ThemeProvider, and renders layout, pages, and the toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable screen showing an access‑denied message with a link back to the shop.",
  "frontend/src/components/AddToOrderControls.tsx": "Quantity selector and add/update/remove controls for adding products to the order draft with toast feedback.",
  "frontend/src/components/admin/OrderRequestsPanel.tsx": "Admin panel listing order requests with status updates, deletion, and loading states.",
  "frontend/src/components/admin/OrderStatusSelect.tsx": "Dropdown for selecting and displaying order status options.",
  "frontend/src/components/admin/ProductAdminList.tsx": "Admin interface for listing, creating, editing, deleting, and toggling stock of products.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for creating or editing products with form state, validation, and React Query mutations.",
  "frontend/src/components/AdminRoute.tsx": "Admin‑only route guard that checks login and admin status, showing loaders or access‑denied screens as needed.",
  "frontend/src/components/Footer.tsx": "Footer with email and Instagram contact links plus branding and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Header with logo, navigation, cart count, login button, and responsive mobile menu using auth and order draft state.",
  "frontend/src/components/Layout.tsx": "Layout component rendering header, footer, and routed page content.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading and error recovery.",
  "frontend/src/components/ProductCard.tsx": "Displays product image, details, price, stock badge, and add-to-order controls.",
  "frontend/src/components/ProductDiscoveryBar.tsx": "Search and scent filter bar with clear functionality for product discovery.",
  "frontend/src/components/ProductImage.tsx": "Product image component with fallback placeholder and error handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/config/payment.ts": "Exports the store’s merchant UPI ID used for payment processing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, with automatic refetching when identity changes.",
  "frontend/src/hooks/useActorState.ts": "Wraps useActor to provide derived loading, ready, and error states for UI handling.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides mutations for creating, updating, deleting, and toggling stock of products via the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching, saving, and checking admin status of the caller’s user profile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, and stored identities.",
  "frontend/src/hooks/useOrderDraft.ts": "Manages a persistent local order draft with products and quantities, including add, update, remove, and clear.",
  "frontend/src/hooks/useOrderRequests.ts": "Hooks for submitting, retrieving, deleting, and updating order requests with price normalization and actor state handling.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID and normalizes its price.",
  "frontend/src/hooks/useProducts.ts": "Fetches all or in‑stock products with caching, retries, and price normalization.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabbed views for product management and order requests.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and a button to return to the storefront.",
  "frontend/src/pages/OrderRequestPage.tsx": "Order submission form handling customer details, items, UPI info, shipping, and actor readiness checks.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows product details, image, price, stock status, and options to add to order.",
  "frontend/src/pages/StorefrontCatalogPage.tsx": "Displays product catalog with search, filtering, hero section, and error handling.",
  "frontend/src/utils/actorErrorMessages.ts": "Utility functions converting actor-related errors into user-friendly messages.",
  "frontend/src/utils/currency.ts": "Helpers for normalizing, converting, and formatting INR prices in paise.",
  "frontend/src/utils/shipping.ts": "Shipping utilities determining fees and free-shipping eligibility based on city.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL params (including hash routing), persist them in sessionStorage, and remove them from the URL when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing the incense shop app’s goals, architecture notes, known issues, and implemented features."
}