{
  "backend/main.mo": "Motoko backend actor handling user profiles, admin‑restricted product CRUD, and order requests with access control and price stored in paise.",
  "backend/migration.mo": "Migration module that maps old product structures to new ones without transformation.",
  "feature_evidence.json": "Feature evidence report listing files and components related to fixing product price scaling to use paise consistently.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, components, and styling utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, CSS variables, and light/dark mode theme values.",
  "frontend/index.html": "Basic HTML entry point containing the root div and script loader for the frontend app.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, ThemeProvider, layout, and global UI elements like Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component displaying an access denied message with a CTA returning to the shop.",
  "frontend/src/components/AddToOrderControls.tsx": "Component managing product quantity selection and adding/updating items in the order draft with toast feedback.",
  "frontend/src/components/admin/OrderRequestsPanel.tsx": "Admin panel listing order requests with totals, contact info, and delete confirmation.",
  "frontend/src/components/admin/ProductAdminList.tsx": "Admin product list with create, edit, delete, and stock‑toggle actions plus editor dialog.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for creating or editing products, handling form state, currency conversion, and submit mutations.",
  "frontend/src/components/AdminRoute.tsx": "Route guard that checks Internet Identity authentication and admin status, showing loading or denial screens as needed.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright info and a caffeine.ai link with dynamic UTM parameters.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, cart count, login button, and mobile menu tied to auth and admin state.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper including header, footer, and routed content outlet.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and query cache clearing.",
  "frontend/src/components/ProductCard.tsx": "Displays product image, details, price, stock status, and add‑to‑order controls.",
  "frontend/src/components/ProductDiscoveryBar.tsx": "Search and scent‑filter bar with clear‑filters control for product browsing.",
  "frontend/src/components/ProductImage.tsx": "Product image component with fallback image and on‑error replacement.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides mutations for creating, updating, deleting, and toggling stock of products using the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and updates the caller's user profile and admin status via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider that manages identity loading, login, logout, and status.",
  "frontend/src/hooks/useOrderDraft.ts": "Manages a local-storage-backed draft order with item add/update/remove operations and price normalization.",
  "frontend/src/hooks/useOrderRequests.ts": "Fetches, submits, and deletes order requests while normalizing product prices.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID and normalizes its price.",
  "frontend/src/hooks/useProducts.ts": "Fetches all products or in-stock products and normalizes prices, integrating actor loading state.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom light/dark theme variables for the app.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders an admin dashboard with tabbed views for managing products and viewing order requests.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays a confirmation message after an order request and provides a button to return to the storefront.",
  "frontend/src/pages/OrderRequestPage.tsx": "Handles order request submission, including item review, customer details, validation, and sending the request.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info with images, stock status, description, and controls for adding items to an order.",
  "frontend/src/pages/StorefrontCatalogPage.tsx": "Displays the product catalog with search, scent filtering, and a hero section, handling loading and error states.",
  "frontend/src/utils/currency.ts": "Provides utilities for converting, normalizing, and formatting INR prices using bigint values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters across navigation using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme settings, colors, fonts, animations, and plugin integrations.",
  "project_state.json": "JSON metadata describing project version, features, issues, and current app state for an incense store app. Includes existing features, known issues, and admin/storefront requirements."
}