{
  "backend/main.mo": "Main Motoko canister implementing user profiles, admin‑controlled product CRUD, and order request handling with access control and migration hook.",
  "backend/migration.mo": "Data migration module converting old order requests by adding default delivery address fields and shippingFee, preserving other state.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and tests related to delivery address and shipping‑fee updates.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing all frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind base layer defining theme CSS variables for light and dark modes with color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "App root setting up TanStack Router, theme, layout, and routes for storefront, order flow, and admin pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen showing an access denied message with a return‑to‑shop button.",
  "frontend/src/components/AddToOrderControls.tsx": "Component providing quantity controls and add/update/remove logic for order draft items with toast feedback.",
  "frontend/src/components/admin/OrderRequestsPanel.tsx": "Admin panel listing order requests with totals, details, and delete confirmation.",
  "frontend/src/components/admin/ProductAdminList.tsx": "Admin product management table supporting creation, editing, deletion, and stock toggling.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Modal form component for creating or updating products with validation and price conversion.",
  "frontend/src/components/AdminRoute.tsx": "Wrapper enforcing admin authentication and authorization, showing loading or denial states as needed.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, branding, and a caffeine.ai referral link.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation, user info, cart button, login, and mobile menu handling.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper rendering header, footer, and routed content.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and query cache reset.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image, details, price, stock status, and add-to-order controls.",
  "frontend/src/components/ProductDiscoveryBar.tsx": "Search and filter bar for products with scent selection and clear-filters option.",
  "frontend/src/components/ProductImage.tsx": "Product image component with placeholder fallback and error handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/config/payment.ts": "Exports the store’s merchant UPI ID for payments.",
  "frontend/src/hooks/useActor.ts": "Initializes an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useActorState.ts": "Wraps useActor to expose loading, ready, and error states plus a retry helper.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides mutations for creating, updating, deleting, and toggling stock status of products using the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks to fetch, update, and check admin status of the current user via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, loading, login, logout, and identity management.",
  "frontend/src/hooks/useOrderDraft.ts": "Manages a locally stored draft order with item add/update/remove and price normalization.",
  "frontend/src/hooks/useOrderRequests.ts": "Provides queries and mutations for order request retrieval, submission, normalization, and deletion.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID with price normalization.",
  "frontend/src/hooks/useProducts.ts": "Fetches all products or in‑stock products with normalization and caching options.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables plus a custom container class.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders an admin dashboard with tabbed views for managing products and order requests.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays a confirmation card after an order is submitted and provides a button to return to the storefront.",
  "frontend/src/pages/OrderRequestPage.tsx": "Handles order form input, calculates totals, validates UPI details, and submits order requests.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays detailed product information with add‑to‑order controls and navigation.",
  "frontend/src/pages/StorefrontCatalogPage.tsx": "Shows the product catalog with search, scent filtering, actor state handling, and a hero section.",
  "frontend/src/utils/actorErrorMessages.ts": "Provides utilities for converting actor and network errors into user-friendly messages.",
  "frontend/src/utils/currency.ts": "Contains helpers for normalizing, converting, and formatting prices between rupees and paise.",
  "frontend/src/utils/shipping.ts": "Implements shipping fee logic, offering free shipping for Gurugram and a flat fee elsewhere.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), store/retrieve them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Tracks the project’s state, goals, known issues, and existing features for the incense shop app."
}