{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Normalize INR minor-unit pricing across the frontend to prevent ₹299 showing as ₹2.99",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Ensure all product and order prices are treated as paise (minor units) in the frontend, including admin create/edit flows and all display locations, so ₹299 renders as ₹299.00 everywhere.",
      "acceptanceCriteria": [
        "A product whose intended price is ₹299 displays as \"₹299.00\" in the storefront catalog cards and on the product detail page.",
        "A product whose intended price is ₹299 displays as \"₹299.00\" in the admin product list and in admin order request totals/line items (wherever prices are shown).",
        "Creating or editing a product in the admin UI using a rupee amount of \"299\" (or \"299.00\") results in a stored value that displays as \"₹299.00\" everywhere in the app.",
        "No UI location displays ₹2.99 for products intended to be priced at ₹299."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/currency.ts",
          "operation": "modify",
          "description": "Add a shared price-normalization utility to consistently interpret backend-provided bigint prices as paise for display and calculations (including a defensive fallback for legacy/incorrect rupee-scaled stored values), and update formatINR to format normalized paise values."
        },
        {
          "path": "frontend/src/hooks/useProducts.ts",
          "operation": "modify",
          "description": "Normalize Product.price values returned from product list queries before they reach UI components, so catalog/admin lists render correct INR values consistently."
        },
        {
          "path": "frontend/src/hooks/useProduct.ts",
          "operation": "modify",
          "description": "Normalize the single Product.price value returned from the product detail query so the product detail page always formats the correct INR amount."
        },
        {
          "path": "frontend/src/hooks/useOrderRequests.ts",
          "operation": "modify",
          "description": "Normalize Product.price values inside fetched OrderRequest product line items so admin order totals/line items compute and render correctly even if stored data is mis-scaled."
        },
        {
          "path": "frontend/src/components/admin/ProductEditorDialog.tsx",
          "operation": "modify",
          "description": "When populating the edit form, display the rupee amount derived from a normalized paise value (so a stored 299 is shown as 299.00 instead of 2.99), and ensure submit continues converting rupee input to paise BigInt consistently."
        },
        {
          "path": "frontend/src/hooks/useOrderDraft.ts",
          "operation": "modify",
          "description": "Ensure products added to the local order draft store a normalized paise price to keep cart/order calculations consistent across sessions and after any data refreshes."
        },
        {
          "path": "frontend/src/pages/OrderRequestPage.tsx",
          "operation": "modify",
          "description": "Update subtotal/line-item total calculations to use normalized paise values (prefer bigint arithmetic over Number conversions) so totals always match formatted INR output."
        },
        {
          "path": "frontend/src/components/admin/OrderRequestsPanel.tsx",
          "operation": "modify",
          "description": "Update order total and line-item computations to use normalized paise values (prefer bigint arithmetic) and render with the shared INR formatter to prevent ₹2.99-style mis-displays in the admin panel."
        }
      ]
    }
  ]
}